#include "puyo_ai.h"

#include "src/ai/ai.h"

#include "src/ai/researcher.h"
#include "src/ai/nomi.h"
#include "src/ai/sea.h"

#include <memory>

std::unique_ptr<AI> ai;


//------------------------------------------------------------------------------
//  Å‰‚É1‰ñ‚¾‚¯ŒÄ‚Î‚ê‚éŠÖ”
//------------------------------------------------------------------------------
extern "C" __declspec(dllexport) void __stdcall ai_init()
{
	ai.reset(new Nomi());
	ai->Init();
}

//------------------------------------------------------------------------------
//  ‘€ì‰Â”Û‚ÉŠÖ‚í‚ç‚¸í‚ÉŒÄ‚Î‚ê‚éŠÖ”
//------------------------------------------------------------------------------
extern "C" __declspec(dllexport) void __stdcall ai_bmain()
{
	ai->PreProcess();
}

//------------------------------------------------------------------------------
//  ‘g‚Õ‚æ‚ªoŒ»‚µ‚½uŠÔ‚ÉŒÄ‚Î‚ê‚éŠÖ”
//------------------------------------------------------------------------------
extern "C" __declspec(dllexport) void __stdcall ai_main()
{
	ai->Main();
}

