//------------------------------------------------------------------------------
//  ぷよAIサンプル
//------------------------------------------------------------------------------
#include "puyo_ai.h"
#include "Game.h"
Game game;
//------------------------------------------------------------------------------
//  最初に1回だけ呼ばれる関数
//------------------------------------------------------------------------------
extern "C" __declspec(dllexport) void __stdcall ai_init()
{
	ai_SetDefSpeed(9); // デフォルト速度
	ai_SetMainMode(1); // ai_mainを操作可能時常に呼ばれるように
	ai_SetBMainMode(1); // 常に呼ばれる関数ai_bmainを追加
}

extern "C" __declspec(dllexport) void __stdcall ai_bmain()
{
	game.Update();
}
//------------------------------------------------------------------------------
//  操作可能時に呼ばれる関数
//------------------------------------------------------------------------------
extern "C" __declspec(dllexport) void __stdcall ai_main()
{
	game.Think();
}

